Merge pull request #3 from ESIR2-PROJECT/VEH-28-refactor-uml-to-mermaid
📝 update puml to mermaid
