--- a/stories/SendFeedback.md
+++ b/stories/SendFeedback.md
@@ -1,16 +1,15 @@
 # Send feedback usecase
 
-```puml
-@startuml
+```mermaid
+sequenceDiagram
 
-Actor User as U
-Participant System as S
+    actor U as User
+    participant S as System
+    
+    U ->> S : Click on "Send Feedback" button
+    S ->> U : Open "Send Feedback" dialog
+    U ->> S : Fill in the form
+    S ->> S : Send the feedback
+    S ->> U : Close the dialog
 
-U -> S : Click on "Send Feedback" button
-S -> U : Open "Send Feedback" dialog
-U -> S : Fill in the form
-S -> S : Send the feedback
-S -> U : Close the dialog
-
-@enduml
 ```
